app/Controllers/Auth.php

    public function process()
    {
        $session = session();
        $model   = new \App\Models\UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $role     = $this->request->getPost('role');

        $user = $model->where('email', $email)
            ->where('password', $password)
            ->where('role', strtolower($role))
            ->first();

        if (!$user) {
            $userCheck = $model->where('email', $email)
                ->where('password', $password)
                ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'hafidz@sekolah.com'
AND `password` = '2'
AND `role` = 'siswa'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'hafidz@sekolah.com'
AND `password` = '2'
 LIMIT 1