app/Controllers/Siswa.php

SELECT *
FROM `jadwal`
WHERE `hari` = 'Rabu'
ORDER BY `jam_mulai` ASC
SELECT *
FROM `absensi`
WHERE `nama` = 'MOCHAMMAD HAFIDZ NUGRAHA'
AND `nis` = '2450231039'
AND `tanggal` = '2025-07-02'
 LIMIT 1
---
    public function beranda()
    {
        $this->cekLoginSiswa();

        $hariIng = date('l');
        $mapHari = [
            'Sunday'    => 'Minggu',
            'Monday'    => 'Senin',
            'Tuesday'   => 'Selasa',
            'Wednesday' => 'Rabu',
            'Thursday'  => 'Kamis',
            'Friday'    => 'Jumat',
            'Saturday'  => 'Sabtu',
        ];
        $hariIndo = $mapHari[$hariIng] ?? $hariIng;

        $isWeekend = in_array($hariIng, ['Saturday', 'Sunday']);

        $jadwalModel = new JadwalModel();
        $jadwalHariIni = [];
        if (! $isWeekend) {
            $jadwalHariIni = $jadwalModel
                ->where('hari', $hariIndo)
                ->orderBy('jam_mulai', 'ASC')
                ->findAll();
        }

        $today = date('Y-m-d');
        $already = (bool) $this->absensiModel
            ->where('nama', session()->get('nama'))
            ->where('nis',  session()->get('nis'))
            ->where('tanggal', $today)
            ->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function editProfil()
    {
        $this->cekLoginSiswa();
        $userModel = new UserModel();
        $user = $userModel->find(session()->get('user_id'));